{"resourceType":"OperationDefinition","id":"Questionnaire-populatehtml","text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\"><h2>QuestionnairePopulateHTML</h2><p>OPERATION: QuestionnairePopulateHTML</p><p>The official URL for this operation definition is: </p><pre>http://hl7.org/fhir/uv/sdc/OperationDefinition/Questionnaire-populatehtml</pre><div><p>Generates an HTML page as a <a href=\"http://hl7.org/fhir/R4/binary.html\">Binary</a> instance  based on a specified <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a>, filling in answers to questions where possible based on information provided as part of the operation or already known by the server about the subject of the <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a>.  If the operation is not called at the instance level, one and only one of the identifier, questionnaire or questionnaireRef <code>in</code> parameters must be provided. If called at the instance level, these parameters will be ignored.  The response will contain a <a href=\"http://hl7.org/fhir/R4/binary.html\">Binary</a> instance containing an HTML page for filling in and submitting the specified <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a> and/or an <a href=\"http://hl7.org/fhir/R4/operationoutcome.html\">OperationOutcome</a> resource with errors or warnings.  The generated HTML form instance will be populated with an unanswered set of questions following the group and question structure of the specified <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a>.  If  <em>content</em> parameters were specified or the <em>local</em> parameter was set to true, some of the questions may have answers filled in as well.  In the case of repeating questions or groups, typically only one repetition will be provided unless answer values exist that would support populating multiple repetitions.  Population of the HTML form with appropriate data is dependent on the questions and/or groups in the <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a> having metadata that allows the server to recognize the questions.  Guidance on mechanisms to perform population can be found <a href=\"populate.html\">here</a>.  Regardless of the mechanism used to link the questions in a questionnaire to a &quot;known&quot; mappable concept, solutions using this operation should ensure that the details of the question and associated linkage element are sufficiently similar as to safely allow auto-population; i.e. the question text and context must be sufficiently the same, the value set for the question must fall within the value set for the mapped element, the data types must be the same or convertible, etc.</p>\n</div><p>URL: [base]/Questionnaire/$populatehtml</p><p>URL: [base]/Questionnaire/[id]/$populatehtml</p><p>Parameters</p><table class=\"grid\"><tr><td><b>Use</b></td><td><b>Name</b></td><td><b>Cardinality</b></td><td><b>Type</b></td><td><b>Binding</b></td><td><b>Documentation</b></td></tr><tr><td>IN</td><td>identifier</td><td>0..1</td><td><a href=\"http://hl7.org/fhir/R4/datatypes.html#uri\">uri</a></td><td/><td><div><p>A logical questionnaire identifier (i.e. <code>Questionnaire.identifier</code>). The server must know the questionnaire or be able to retrieve it from other known repositories.</p>\n</div></td></tr><tr><td>IN</td><td>questionnaire</td><td>0..1</td><td><a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a></td><td/><td><div><p>The <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a> is provided directly as part of the request. Servers may choose not to accept questionnaires in this fashion</p>\n</div></td></tr><tr><td>IN</td><td>questionnaireRef</td><td>0..1</td><td><a href=\"http://hl7.org/fhir/R4/references.html#Reference\">Reference</a></td><td/><td><div><p>The <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a> is provided as a resource reference. Servers may choose not to accept questionnaires in this fashion or may fail if they cannot resolve or access the referenced questionnaire.</p>\n</div></td></tr><tr><td>IN</td><td>content</td><td>0..*</td><td><a href=\"http://hl7.org/fhir/R4/references.html#Reference\">Reference</a></td><td/><td><div><p>Resources containing information to be used to help populate the generated HTML form.  These may be FHIR resources or may be binaries containing FHIR documents, CDA documents or other source materials.  Servers might not support all possible source materials and may ignore materials they do not recognize.  (They MAY provide warnings if ignoring submitted resources.)</p>\n</div></td></tr><tr><td>IN</td><td>local</td><td>0..1</td><td><a href=\"http://hl7.org/fhir/R4/datatypes.html#boolean\">boolean</a></td><td/><td><div><p>If specified and set to <code>true</code> (and the server is capable), the server should use what resources and other knowledge it has about the referenced subject when pre-populating answers to questions.</p>\n</div></td></tr><tr><td>OUT</td><td>form</td><td>1..1</td><td><a href=\"http://hl7.org/fhir/R4/binary.html\">Binary</a></td><td/><td><div><p>The generated HTML page that supports capturing the information defined by questionnaire, possibly partially (or fully)-populated with a set of answers for the specified Questionnaire</p>\n</div></td></tr><tr><td>OUT</td><td>issues</td><td>0..1</td><td><a href=\"http://hl7.org/fhir/R4/operationoutcome.html\">OperationOutcome</a></td><td/><td><div><p>A list of hints and warnings about problems encountered while populating the questionnaire. These might be show to the user as an advisory note. Note: if the questionnaire cannot be populated at all, then the operation should fail, and an OperationOutcome is returned directly with the failure, rather than using this parameter</p>\n</div></td></tr></table><div><p>While it is theoretically possible for an HTML form to be completely auto-populated and submitted without human review, the intention of this transaction is merely to reduce redundant data entry.  The HTML form <strong>SHOULD</strong> ensure that a human submitter has an opportunity to review the auto-populated answers to confirm correctness as well as to complete or expand on information provided by the auto-population process.  Complex form designs with conditional logic or tight constraints on cardinalities may be challenging to auto-populate.  A server MAY choose to traverse the questionnaire as if it were a human respondent, answering only those questions that are enabled based on previously answered questions.  However, doing so may result in minimal population.  Alternatively, systems may choose to populate all known answers, independent of dependencies and other constraints.  This may cause questions to be answered that should not be answered.  The generated HTML form is responsible for pruning the final populated questionnaire once human review has taken place.  Invoking this operation with the <code>content</code> parameter may involve the disclosure of personally identifiable healthcare information to the system which is performing the population process.  No such disclosures should be made unless the system on which the operation is being invoked is a &quot;trusted&quot; system and appropriate agreements are in place to protect the confidentiality of any information shared with that system.</p>\n</div></div>"},"url":"http://hl7.org/fhir/uv/sdc/OperationDefinition/Questionnaire-populatehtml","version":"2.8.0","name":"QuestionnairePopulateHTML","title":"Generate HTML for Questionnaire","status":"draft","kind":"operation","date":"2018-08-19T11:48:56+00:00","publisher":"HL7 International - FHIR Infrastructure Work Group","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/Special/committees/fiwg"}]}],"description":"Generates an HTML page as a [Binary](http://hl7.org/fhir/R4/binary.html) instance  based on a specified [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html), filling in answers to questions where possible based on information provided as part of the operation or already known by the server about the subject of the [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html).  If the operation is not called at the instance level, one and only one of the identifier, questionnaire or questionnaireRef `in` parameters must be provided. If called at the instance level, these parameters will be ignored.  The response will contain a [Binary](http://hl7.org/fhir/R4/binary.html) instance containing an HTML page for filling in and submitting the specified [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html) and/or an [OperationOutcome](http://hl7.org/fhir/R4/operationoutcome.html) resource with errors or warnings.  The generated HTML form instance will be populated with an unanswered set of questions following the group and question structure of the specified [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html).  If  *content* parameters were specified or the *local* parameter was set to true, some of the questions may have answers filled in as well.  In the case of repeating questions or groups, typically only one repetition will be provided unless answer values exist that would support populating multiple repetitions.  Population of the HTML form with appropriate data is dependent on the questions and/or groups in the [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html) having metadata that allows the server to recognize the questions.  Guidance on mechanisms to perform population can be found [here](populate.html).  Regardless of the mechanism used to link the questions in a questionnaire to a \"known\" mappable concept, solutions using this operation should ensure that the details of the question and associated linkage element are sufficiently similar as to safely allow auto-population; i.e. the question text and context must be sufficiently the same, the value set for the question must fall within the value set for the mapped element, the data types must be the same or convertible, etc.","jurisdiction":[{"coding":[{"system":"http://unstats.un.org/unsd/methods/m49/m49.htm","code":"001"}]}],"code":"populatehtml","comment":"While it is theoretically possible for an HTML form to be completely auto-populated and submitted without human review, the intention of this transaction is merely to reduce redundant data entry.  The HTML form **SHOULD** ensure that a human submitter has an opportunity to review the auto-populated answers to confirm correctness as well as to complete or expand on information provided by the auto-population process.  Complex form designs with conditional logic or tight constraints on cardinalities may be challenging to auto-populate.  A server MAY choose to traverse the questionnaire as if it were a human respondent, answering only those questions that are enabled based on previously answered questions.  However, doing so may result in minimal population.  Alternatively, systems may choose to populate all known answers, independent of dependencies and other constraints.  This may cause questions to be answered that should not be answered.  The generated HTML form is responsible for pruning the final populated questionnaire once human review has taken place.  Invoking this operation with the `content` parameter may involve the disclosure of personally identifiable healthcare information to the system which is performing the population process.  No such disclosures should be made unless the system on which the operation is being invoked is a \"trusted\" system and appropriate agreements are in place to protect the confidentiality of any information shared with that system.","resource":["Questionnaire"],"system":false,"type":true,"instance":true,"parameter":[{"name":"identifier","use":"in","min":0,"max":"1","documentation":"A logical questionnaire identifier (i.e. `Questionnaire.identifier`). The server must know the questionnaire or be able to retrieve it from other known repositories.","type":"uri"},{"name":"questionnaire","use":"in","min":0,"max":"1","documentation":"The [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html) is provided directly as part of the request. Servers may choose not to accept questionnaires in this fashion","type":"Questionnaire"},{"name":"questionnaireRef","use":"in","min":0,"max":"1","documentation":"The [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html) is provided as a resource reference. Servers may choose not to accept questionnaires in this fashion or may fail if they cannot resolve or access the referenced questionnaire.","type":"Reference","targetProfile":["http://hl7.org/fhir/StructureDefinition/Questionnaire"]},{"name":"content","use":"in","min":0,"max":"*","documentation":"Resources containing information to be used to help populate the generated HTML form.  These may be FHIR resources or may be binaries containing FHIR documents, CDA documents or other source materials.  Servers might not support all possible source materials and may ignore materials they do not recognize.  (They MAY provide warnings if ignoring submitted resources.)","type":"Reference"},{"name":"local","use":"in","min":0,"max":"1","documentation":"If specified and set to `true` (and the server is capable), the server should use what resources and other knowledge it has about the referenced subject when pre-populating answers to questions.","type":"boolean"},{"name":"form","use":"out","min":1,"max":"1","documentation":"The generated HTML page that supports capturing the information defined by questionnaire, possibly partially (or fully)-populated with a set of answers for the specified Questionnaire","type":"Binary"},{"name":"issues","use":"out","min":0,"max":"1","documentation":"A list of hints and warnings about problems encountered while populating the questionnaire. These might be show to the user as an advisory note. Note: if the questionnaire cannot be populated at all, then the operation should fail, and an OperationOutcome is returned directly with the failure, rather than using this parameter","type":"OperationOutcome"}]}