{"resourceType":"OperationDefinition","id":"Questionnaire-next-question","text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\"><h2>NextQuestion</h2><p>OPERATION: NextQuestion</p><p>The official URL for this operation definition is: </p><pre>http://hl7.org/fhir/uv/sdc/OperationDefinition/Questionnaire-next-question</pre><div><p>The Next Question operation is used for <em>adaptive questionnaires</em> - forms where the next question (or set of questions) is based on previous answers.  The result of this operation is to return an updated QuestionnaireResponse with a contained Questionnaire that includes the next question (or set of questions).  It might also include display items with instructions and/or read-only questions containing calculated scores.  This operation uses the <a href=\"http://hl7.org/fhir/R4/questionnaireresponse.html\">QuestionnaireResponse</a> resource with a <a href=\"http://hl7.org/fhir/R4/references.html#contained\"><em>contained</em></a> <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire</a> as both the input and output parameter. The client initiates and queries for the next question by including the answers to all required questions in the questionnaire to that point.  The Server updates the contained Questionnaire in the QuestionnaireResponse in the with the next question or set of questions and any needed instruction or score items.  When the questionnaire is complete, the Server updates the <code>QuestionnaireResponse.status</code> resource parameter to <code>complete</code>.  If completion of the questionnaire has exceeded any time limit, the Server may return an <a href=\"http://hl7.org/fhir/R4/operationoutcome.html\">OperationOutcome</a> with an error.</p>\n</div><p>URL: [base]/Questionnaire/$next-question</p><p>Parameters</p><table class=\"grid\"><tr><td><b>Use</b></td><td><b>Name</b></td><td><b>Cardinality</b></td><td><b>Type</b></td><td><b>Binding</b></td><td><b>Documentation</b></td></tr><tr><td>IN</td><td>questionnaire-response</td><td>1..1</td><td><a href=\"http://hl7.org/fhir/R4/resource.html\">Resource</a></td><td/><td><div><p>The <a href=\"sdc-questionnaireresponse-adapt.html\">Adaptive QuestionnaireResponse Profile</a> of the QuestionnaireResponse resource with a <em>contained</em> Questionnaire.  When invoking the operation for the first time, neither the QuestionnaireResponse nor the contained Questionnaire will have any items, as no questions are yet known.  In subsequent calls, the QuestionnaireResponse will include answers to all required questions asked so far and the contained QuestionnaireResponse will remain the same as provided back from the operation in the preceding response.</p>\n</div></td></tr><tr><td>OUT</td><td>return</td><td>1..1</td><td><a href=\"http://hl7.org/fhir/R4/resource.html\">Resource</a></td><td/><td><div><p>The <a href=\"sdc-questionnaireresponse-adapt.html\">Adaptive QuestionnaireResponse Profile</a> of the QuestionnaireResponse resource with a <em>contained</em> Questionnaire.  The Server updates the QuestionnaireResponse's contained Questionnaire by appending with the next question or questions ittems and any score or instruction items and returns the QuestionnaireResponse (with all answers completed thus far plus any calculated scores) as this parameter.  When the questionnaire is complete, the Server updates the status of the QuestionnaireResponse resource parameter to <code>complete</code>.</p>\n</div></td></tr></table><div><p>To return a calculated score for the questionnaire or group of items, the service may return a <code>readOnly</code> question with the score value in the corresponding QuestionnaireResponse.item.  The extension <code>questionnaire-hidden</code> can be included on the Questionnaire.item to indicate to the client that it should not be displayed to the end user</p>\n</div></div>"},"url":"http://hl7.org/fhir/uv/sdc/OperationDefinition/Questionnaire-next-question","version":"2.8.0","name":"NextQuestion","title":"Adaptive Questionnaire - Next Question Operation","status":"draft","kind":"operation","date":"2018-08-29T00:00:00+00:00","publisher":"HL7 International - FHIR Infrastructure Work Group","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/Special/committees/fiwg"}]}],"description":"The Next Question operation is used for *adaptive questionnaires* - forms where the next question (or set of questions) is based on previous answers.  The result of this operation is to return an updated QuestionnaireResponse with a contained Questionnaire that includes the next question (or set of questions).  It might also include display items with instructions and/or read-only questions containing calculated scores.  This operation uses the [QuestionnaireResponse](http://hl7.org/fhir/R4/questionnaireresponse.html) resource with a [*contained*](http://hl7.org/fhir/R4/references.html#contained) [Questionnaire](http://hl7.org/fhir/R4/questionnaire.html) as both the input and output parameter. The client initiates and queries for the next question by including the answers to all required questions in the questionnaire to that point.  The Server updates the contained Questionnaire in the QuestionnaireResponse in the with the next question or set of questions and any needed instruction or score items.  When the questionnaire is complete, the Server updates the `QuestionnaireResponse.status` resource parameter to `complete`.  If completion of the questionnaire has exceeded any time limit, the Server may return an [OperationOutcome](http://hl7.org/fhir/R4/operationoutcome.html) with an error.","jurisdiction":[{"coding":[{"system":"http://unstats.un.org/unsd/methods/m49/m49.htm","code":"001"}]}],"code":"next-question","comment":"To return a calculated score for the questionnaire or group of items, the service may return a `readOnly` question with the score value in the corresponding QuestionnaireResponse.item.  The extension `questionnaire-hidden` can be included on the Questionnaire.item to indicate to the client that it should not be displayed to the end user","resource":["Questionnaire"],"system":false,"type":true,"instance":false,"inputProfile":"http://hl7.org/fhir/uv/sdc/StructureDefnition/parameters-questionnaire-next-question-in","outputProfile":"http://hl7.org/fhir/uv/sdc/StructureDefnition/parameters-questionnaire-next-question-in","parameter":[{"name":"questionnaire-response","use":"in","min":1,"max":"1","documentation":"The [Adaptive QuestionnaireResponse Profile](sdc-questionnaireresponse-adapt.html) of the QuestionnaireResponse resource with a *contained* Questionnaire.  When invoking the operation for the first time, neither the QuestionnaireResponse nor the contained Questionnaire will have any items, as no questions are yet known.  In subsequent calls, the QuestionnaireResponse will include answers to all required questions asked so far and the contained QuestionnaireResponse will remain the same as provided back from the operation in the preceding response.","type":"Resource"},{"name":"return","use":"out","min":1,"max":"1","documentation":"The [Adaptive QuestionnaireResponse Profile](sdc-questionnaireresponse-adapt.html) of the QuestionnaireResponse resource with a *contained* Questionnaire.  The Server updates the QuestionnaireResponse's contained Questionnaire by appending with the next question or questions ittems and any score or instruction items and returns the QuestionnaireResponse (with all answers completed thus far plus any calculated scores) as this parameter.  When the questionnaire is complete, the Server updates the status of the QuestionnaireResponse resource parameter to `complete`.","type":"Resource"}]}